#+STARTUP: overview hideblocks
#+LATEX: \documentclass[]{twentysecondcv}

#+LATEX: \begin{document}

#+CALL: latex-contact-info()

#+RESULTS:
#+begin_export latex
\profilepic{resources/muffin-avatar.jpg}
\cvname{Brandon Ellington}
\cvjobtitle{Networked\n +Social Systems Engineer}
\cvdate{June 25 1993}
\cvaddress{United States}
\cvnumberphone{(206)450-1343}
\cvmail{branjam4@gmail.com}
\cvsite{branjam.dev}
#+end_export

#+begin_export latex
\aboutme{
I use metacognition to link big picture insights with individual experiences, I make the critical connections to help teams move forward faster.

Interests

- Building technical and social trust into systems.

\n- Measuring growth in creative and valuable ways.

\n- Using critical thinking to empower organizations to make change.}
#+end_export

#+CALL: makeskillbar()

#+RESULTS:
#+begin_export latex
\skills{{Python/4},{Critical Thinking/5},{Systems Engineering/4},{Social Data Mining/3.6},{Version Control/3.5}}
#+end_export

#+CALL: makeskillstext()

#+RESULTS:
#+begin_export latex
\skillstext{{emacs/3.4},{shell/3.4},{database querying/3},{org-mode/3},{object-oriented programming/2.9},{image provisioning/2.5},{clojure/2.1},{php/2}}
#+end_export

#+LATEX: \makeprofile

*** twentyitem/twentyitemshort
These use:
+ ~orgtbl-to-generic~ :: to break the org table down,
+ ~org-combine-plists~ :: to construct a proper =\begin...end{twenty}= container, separating items by new lines.
#+NAME: ticonv
#+BEGIN_SRC elisp :exports none
(defun orgtbl-to-twentyitem (table params)
       "Convert the orgtbl-mode TABLE to a TwentySeconds CV {twentyitem} table."
       (orgtbl-to-generic
        table
        (org-combine-plists
         '(:tstart "\\begin{twenty}" :tend "\\end{twenty}" :lstart "  \\twentyitem\n" :lend "" :fmt "    {%s}" :llfmt "" :sep "\n")
         params)))

(defun orgtbl-to-twentyitemshort (table params)
       "Convert the orgtbl-mode TABLE to a TwentySeconds CV {twentyitemshort} table."
       (orgtbl-to-generic
        table
        (org-combine-plists
         '(:tstart "\\begin{twentyshort}" :tend "\\end{twentyshort}" :lstart "  \\twentyitemshort\n" :lend "" :fmt "    {%s}" :llfmt "" :sep "\n")
         params)))
#+END_SRC

#+RESULTS: ticonv
: orgtbl-to-twentyitemshort

#+NAME: maketi
#+BEGIN_SRC elisp :var tb=education-table :var params='(:skip 2) :results latex :exports results :prologue ticonv
(orgtbl-to-twentyitem tb params)
#+END_SRC

#+RESULTS: maketi
#+begin_export latex
\begin{twenty}
  \twentyitem
    {2017-2020}
    {Bachelor of Science}
    {The Evergreen State College}
    {Majoring in Computer Science}
  \twentyitem
    {2017-2020}
    {Bachelor of Arts}
    {The Evergreen State College}
    {Business Concentration}
\end{twenty}
#+end_export

#+NAME: mktishort
#+BEGIN_SRC elisp :var tb=awards-table :results latex :exports results :prologue ticonv
(orgtbl-to-twentyitemshort tb '(:skip 2))
#+END_SRC

#+RESULTS: mktishort
#+begin_export latex
\begin{twentyshort}
  \twentyitemshort
    {June 2019}
    {Innovation Across the Americas Scholarship}
  \twentyitemshort
    {October 2018}
    {Equity Honors Nominee}
\end{twentyshort}
#+end_export
*** skills/skillstext
These use ~orgtbl-to-orgtbl~ to trim the top rows and the last row, so we're left with just the data we need to work with. The example file has all these skills comma separated on one line. But ~orgtbl-to-<othertable>~ explicitly enters a new line per table row, so I send these to separate functions for the latex processing.

#+NAME: skillsconv
#+BEGIN_SRC elisp :var tb=skills-table :results raw :exports results 
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: skillsconv
| pursuer of rabbits |    5 |
| good manners       |    4 |
| outgoing           |  4.3 |
| polite             |    4 |
| Java               | 0.01 |

#+NAME: makeskillbar
#+BEGIN_SRC elisp :var tbl=skillsconv :results latex
(concat "\\skills{"
        (mapconcat
         (lambda (x)
           (concat "{" (car x) "/" (cadr x) "}"))
         (org-table-to-lisp tbl) ",")
        "}")
#+END_SRC

#+RESULTS: makeskillbar
#+begin_export latex
\skills{{pursuer of rabbits/5},{good manners/4},{outgoing/4.3},{polite/4},{Java/0.01}}
#+end_export

#+NAME: skillstextconv
#+BEGIN_SRC elisp :var tb=skillstext-table :results raw :exports results 
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: skillstextconv
| lovely       | 4 |
| narcissistic | 3 |

#+NAME: makeskillstext
#+BEGIN_SRC elisp :var tbl=skillstextconv :results latex
(concat "\\skillstext{"
        (mapconcat
         (lambda (x)
           (concat "{" (car x) "/" (cadr x) "}"))
         (org-table-to-lisp tbl) ",")
        "}")
#+END_SRC

#+RESULTS: makeskillstext
#+begin_export latex
\skillstext{{lovely/4},{narcissistic/3}}
#+end_export

*** Contact/personal info
Similar process as the skills and skilltext, but a little simpler since we do not have to trim the table first.

#+NAME: latex-contact-info
#+BEGIN_SRC elisp :var tbl=contact-table :results latex
(mapconcat (lambda (x) (concat "\\" (car x) "{" (cadr x) "}")) tbl "\n")
#+END_SRC

#+RESULTS: latex-contact-info
#+begin_export latex
\profilepic{alice.jpeg}
\cvname{Alice}
\cvjobtitle{Adventurer}
\cvdate{26 November 1865}
\cvaddress{United Kingdom}
\cvnumberphone{+39 0325658974}
\cvmail{alice@wonderland.com}
\cvsite{http://en.wikipedia.org}
#+end_export
** Third: Load data
:PROPERTIES:
:VISIBILITY: folded
:END:   
Compare with [[file:20200902004719-twentyseconds_cv_example_static.org][TwentySeconds CV Example (Static)]]
We can use ~org-export-dispatch~ to interactively make a =.tex= buffer/file (for comparison with the original example), or we can produce a pdf directly after setup. In either case org inserts some extra metadata into the =latex= output, which may not be what we want. So we must enable the =Body only:= option in the dispatch menu (which should be ~Ctrl+b~ while in the menu). See the below section for some troubleshooting hints.

Assuming a successful build, the following produces a pdf file non-interactively, so you can use it as a hook or in a script if you choose to extend this:
#+BEGIN_SRC elisp
(org-latex-export-to-pdf nil nil nil 'only-body nil)
#+END_SRC

#+RESULTS:
: /home/branjam/Downloads/resume/resume.pdf

